Table of Contents
 Class CadBimLink
Namespace
IdeaStatiCa.BimApiLink
Assembly
IdeaStatiCa.BimApiLink.dll
public class CadBimLink : BimLink
Inheritance
object
BimLink
CadBimLink
Inherited Members
 BimLink.ApplicationName
 BimLink.WithIdeaStatiCa(string)
 BimLink.WithLogger(IPluginLogger)
 BimLink.WithImporters(Action<ImportersConfiguration>)
 BimLink.WithResultsImporters(Action<ResultsImportersConfiguration>)
 BimLink.WithBimImporterConfiguration(BimImporterConfiguration)
 BimLink.WithImporterHook(IImporterHook)
 BimLink.WithPluginHook(IPluginHook)
 BimLink.WithScopeHook(IScopeHook)
 BimLink.WithUserDataSource(IBimUserDataSource)
 BimLink.WithTaskScheduler(TaskScheduler)
 BimLink.InitHostingClient(IPluginLogger)
 BimLink.Run(IModel)
 BimLink.CreateApplicationBIM(IModel, IPluginLogger, IProgressMessaging)
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 CadBimLink(string, string)
public CadBimLink(string applicationName, string projectPath)
Parameters
applicationName string
projectPath string
Methods
 Create(IPluginLogger, IBimApiImporter, string, BimImporterConfiguration, IProgressMessaging, IBimResultsProvider, IPluginHook, IScopeHook, IModel, IBimUserDataSource, TaskScheduler)
protected override IApplicationBIM Create(IPluginLogger logger, IBimApiImporter bimApiImporter, string projectPath, BimImporterConfiguration bimImporterConfiguration, IProgressMessaging remoteApp, IBimResultsProvider resultsProvider, IPluginHook pluginHook, IScopeHook scopeHook, IModel feaModel, IBimUserDataSource userDataSource, TaskScheduler taskScheduler)
Parameters
logger IPluginLogger
bimApiImporter IBimApiImporter
projectPath string
bimImporterConfiguration BimImporterConfiguration
remoteApp IProgressMessaging
resultsProvider IBimResultsProvider
pluginHook IPluginHook
scopeHook IScopeHook
feaModel IModel
userDataSource IBimUserDataSource
taskScheduler TaskScheduler
Returns
IApplicationBIM
 Create(string, string)
public static BimLink Create(string applicationName, string checkbotProjectPath)
Parameters
applicationName string
checkbotProjectPath string
Returns
BimLink
 CreateApplicationInstace(IPluginLogger, IBimApiImporter, IPluginHook, IScopeHook, IBimUserDataSource, IProjectStorage, IProject, IBimImporter, TaskScheduler)
protected virtual IApplicationBIM CreateApplicationInstace(IPluginLogger logger, IBimApiImporter bimApiImporter, IPluginHook pluginHook, IScopeHook scopeHook, IBimUserDataSource userDataSource, IProjectStorage projectStorage, IProject projectAdapter, IBimImporter bimImporter, TaskScheduler taskScheduler)
Parameters
logger IPluginLogger
bimApiImporter IBimApiImporter
pluginHook IPluginHook
scopeHook IScopeHook
userDataSource IBimUserDataSource
projectStorage IProjectStorage
projectAdapter IProject
bimImporter IBimImporter
taskScheduler TaskScheduler
Returns
IApplicationBIM
 Edit this page